# BuiltInFailures.StructuralAssetFailures Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..StructuralAssetFailures Class
BuiltInFailures Class Members See Also
---
Failures related to structural materials.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static class StructuralAssetFailures
```

Visual Basic
---
```text
Public NotInheritable Class StructuralAssetFailures
```

Visual C++
---
```text
public ref class StructuralAssetFailures abstract sealed
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..BuiltInFailures..::..StructuralAssetFailures
# See Also
BuiltInFailures..::..StructuralAssetFailures Members
Autodesk.Revit.DB Namespace